Python 3.14.0 (tags/v3.14.0:ebf955d, Oct  7 2025, 10:15:03) [MSC v.1944 64 bit (AMD64)] on win32
Enter "help" below or click "Help" above for more information.

===== RESTART: C:\Users\nasks\OneDrive\문서\컴프2 공부\1031-2023100032-송채언-과제.py =====
반 수 입력: 2
반별 학생 수 입력: 3

국어 점수 입력: 78
영어 점수 입력: 69
합 = 147, 평균 = 73.50

국어 점수 입력: 66
영어 점수 입력: 31
합 = 97, 평균 = 48.50

국어 점수 입력: 80
영어 점수 입력: 95
합 = 175, 평균 = 87.50

국어 점수 입력: 55
영어 점수 입력: 43
합 = 98, 평균 = 49.00

국어 점수 입력: 76
영어 점수 입력: 72
합 = 148, 평균 = 74.00

국어 점수 입력: 82
영어 점수 입력: 71
합 = 153, 평균 = 76.50

총합 = 818, 과목 당 평균 = 68.16666666666667
>>> 
===== RESTART: C:\Users\nasks\OneDrive\문서\컴프2 공부\1031-2023100032-송채언-과제.py =====
반 수 입력: 2
반별 학생 수 입력: 3

국어 점수 입력: 78
영어 점수 입력: 69
합 = 147, 평균 = 73.50

국어 점수 입력: 66
영어 점수 입력: 31
합 = 97, 평균 = 48.50

국어 점수 입력: 80
영어 점수 입력: 95
합 = 175, 평균 = 87.50

국어 점수 입력: 55
영어 점수 입력: 43
합 = 98, 평균 = 49.00

국어 점수 입력: 76
영어 점수 입력: 72
합 = 148, 평균 = 74.00

국어 점수 입력: 82
영어 점수 입력: 71
합 = 153, 평균 = 76.50

총합 = 818, 과목 당 평균 = 68.17
