Python 3.14.0 (tags/v3.14.0:ebf955d, Oct  7 2025, 10:15:03) [MSC v.1944 64 bit (AMD64)] on win32
Enter "help" below or click "Help" above for more information.
>>> 
================================================================= RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-1.py ================================================================
36
22
10
1
22
13
>>> 
====== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-2.py =====
OXXX
OXXX
OXXX
OXXX
OXXX
OXXX
OXXX
>>> 
====== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-2.py =====
**************************************************
>>> 
====== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-2.py =====
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*
*

====== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-2.py =====
**********
**********
**********
**********
**********

====== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-2.py =====
a01234
b01234
c01234
d01234
e01234

====== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-2.py =====
*
**
***
****
*****

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-2.py ==========
*
**
***
****
*****

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-3.py ==========
시작 단?? 3
끝 단?? 9
3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27

3 * 9 = 27


========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-3.py ==========
시작 단?? 3
끝 단?? 9
3 * 1 = 3

3 * 2 = 6

3 * 3 = 9

3 * 4 = 12

3 * 5 = 15

3 * 6 = 18

3 * 7 = 21

3 * 8 = 24

3 * 9 = 27

3 * 1 = 3

3 * 2 = 6

3 * 3 = 9

3 * 4 = 12

3 * 5 = 15

3 * 6 = 18

3 * 7 = 21

3 * 8 = 24

3 * 9 = 27


========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-3.py ==========
시작 단?? 3
끝 단?? 9
3 * 1 = 3
3 * 2 = 6
3 * 3 = 9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27

3 * 1 = 3
3 * 2 = 6
3 * 3 = 9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27


========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-3.py ==========
시작 단?? 3
끝 단?? 9
3 * 1 = 3
3 * 2 = 6
3 * 3 = 9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27

3 * 1 = 3
3 * 2 = 6
3 * 3 = 9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27

3 * 1 = 3
3 * 2 = 6
3 * 3 = 9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27

3 * 1 = 3
3 * 2 = 6
3 * 3 = 9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27

3 * 1 = 3
3 * 2 = 6
3 * 3 = 9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27

3 * 1 = 3
3 * 2 = 6
3 * 3 = 9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27

3 * 1 = 3
3 * 2 = 6
3 * 3 = 9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27


========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-3.py ==========
시작 단?? 3 * 2 = 69
Traceback (most recent call last):
  File "C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-3.py", line 3, in <module>
    x = int(input("시작 단?? "))
ValueError: invalid literal for int() with base 10: '3 * 2 = 69'

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-3.py ==========
시작 단?? 4
끝 단?? 9
4 * 1 = 4
4 * 2 = 8
4 * 3 = 12
4 * 4 = 16
4 * 5 = 20
4 * 6 = 24
4 * 7 = 28
4 * 8 = 32
4 * 9 = 36

5 * 1 = 5
5 * 2 = 10
5 * 3 = 15
5 * 4 = 20
5 * 5 = 25
5 * 6 = 30
5 * 7 = 35
5 * 8 = 40
5 * 9 = 45

6 * 1 = 6
6 * 2 = 12
6 * 3 = 18
6 * 4 = 24
6 * 5 = 30
6 * 6 = 36
6 * 7 = 42
6 * 8 = 48
6 * 9 = 54

7 * 1 = 7
7 * 2 = 14
7 * 3 = 21
7 * 4 = 28
7 * 5 = 35
7 * 6 = 42
7 * 7 = 49
7 * 8 = 56
7 * 9 = 63

8 * 1 = 8
8 * 2 = 16
8 * 3 = 24
8 * 4 = 32
8 * 5 = 40
8 * 6 = 48
8 * 7 = 56
8 * 8 = 64
8 * 9 = 72

9 * 1 = 9
9 * 2 = 18
9 * 3 = 27
9 * 4 = 36
9 * 5 = 45
9 * 6 = 54
9 * 7 = 63
9 * 8 = 72
9 * 9 = 81


========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-4.py ==========
샌드위치+커피

샌드위치+주스

와플+커피

와플+주스

베이글+커피

베이글+주스


========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-4.py ==========
샌드위치+커피

샌드위치+커피

샌드위치+커피

샌드위치+커피

샌드위치+커피

샌드위치+커피

샌드위치+주스

샌드위치+주스

샌드위치+주스

샌드위치+주스

샌드위치+주스

샌드위치+주스

와플+커피

와플+커피

와플+커피

와플+커피

와플+커피

와플+커피

와플+주스

와플+주스

와플+주스

와플+주스

와플+주스

와플+주스

베이글+커피

베이글+커피

베이글+커피

베이글+커피

베이글+커피

베이글+커피

베이글+주스

베이글+주스

베이글+주스

베이글+주스

베이글+주스

베이글+주스


========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-4.py ==========
1 샌드위치+커피
2 샌드위치+주스
3 와플+커피
4 와플+주스
5 베이글+커피
6 베이글+주스

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-과제.py =========
반 수 입력: 2
반별 학생 수 입력: 3

국어 점수 입력: 78
영어 점수 입력: 69
합 = 147, 평균 = 73.5
국어 점수 입력: 66
영어 점수 입력: 31
합 = 244, 평균 = 122.0
국어 점수 입력: 
========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-과제.py =========
반 수 입력: 
========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-과제.py =========
반 수 입력: 2
반별 학생 수 입력: 3

국어 점수 입력: 78
영어 점수 입력: 69
합 = 147, 평균 = 73.5

국어 점수 입력: 66
영어 점수 입력: 31
합 = 97, 평균 = 48.5

국어 점수 입력: 80
영어 점수 입력: 95
합 = 175, 평균 = 87.5

국어 점수 입력: 55
영어 점수 입력: 43
합 = 98, 평균 = 49.0

국어 점수 입력: 76
영어 점수 입력: 72
합 = 148, 평균 = 74.0

국어 점수 입력: 82
영어 점수 입력: 71
합 = 153, 평균 = 76.5

총합 = 818, 과목 당 평균 = 1227.0

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-과제.py =========
반 수 입력: 2
반별 학생 수 입력: 3

국어 점수 입력: 78
영어 점수 입력: 69
합 = 147, 평균 = 73.5

국어 점수 입력: 66
영어 점수 입력: 31
합 = 97, 평균 = 48.5

국어 점수 입력: 80
영어 점수 입력: 95
합 = 175, 평균 = 87.5

국어 점수 입력: 55
영어 점수 입력: 43
합 = 98, 평균 = 49.0

국어 점수 입력: 76
영어 점수 입력: 72
합 = 148, 평균 = 74.0

국어 점수 입력: 82
영어 점수 입력: 71
합 = 153, 평균 = 76.5

총합 = 818, 과목 당 평균 = 136.33333333333334

max(10, 20)
20
min(10, 20, 30, 40)
10
x = [3, 1, 2]
x.sort
<built-in method sort of list object at 0x000001F2552BBB80>

sorted([4. 1. 2. 3])
SyntaxError: invalid syntax. Perhaps you forgot a comma?
sorted([4, 1, 2, 3])
[1, 2, 3, 4]

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-5.py ==========
55
209
462

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-6.py ==========
55

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-6.py ==========
55

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-6.py ==========
55
324

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-6.py ==========
55

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-6.py ==========
55
Traceback (most recent call last):
  File "C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-6.py", line 24, in <module>
    print(add)
NameError: name 'add' is not defined

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-6.py ==========
55

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-6.py ==========
Traceback (most recent call last):
  File "C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-6.py", line 24, in <module>
    print(add)
NameError: name 'add' is not defined

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-6.py ==========
55
55

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-6.py ==========
None

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-7.py ==========
정수 입력: 5



========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-7.py ==========
정수 입력: 5

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-7.py ==========
반지름 입력: 5.2
Traceback (most recent call last):
  File "C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-7.py", line 22, in <module>
    n = int(input("반지름 입력: "))
ValueError: invalid literal for int() with base 10: '5.2'

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-7.py ==========
반지름 입력: 5.2
원의 넓이 = (3, 378.56)

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-7.py ==========
반지름 입력: 5.2
원의 넓이 =  (3, 378.56)

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-7.py ==========
이름 입력: dudgml
생일 축하합니다!
생일 축하합니다!
사랑하는 dudgml의 생일 축하합니다!

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-7.py ==========
이름 입력: 영희
생일 축하합니다!
생일 축하합니다!
사랑하는 영희의 생일 축하합니다!

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-8.py ==========
수1 입력: 3
수2 입력: 5
5

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-8.py ==========
수1 입력: 5
수2 입력: 5
5

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-8.py ==========
수1 입력: 5
수2 입력: 5
-1

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-8.py ==========
수1 입력: 3
수2 입력: -1
3

========== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-8.py ==========
Traceback (most recent call last):
  File "C:/Users/nasks/OneDrive/문서/컴프2 공부/1031-2023100032-송채언-8.py", line 21, in <module>
    출력(num1, num2)
NameError: name 'num1' is not defined
