Python 3.14.0 (tags/v3.14.0:ebf955d, Oct  7 2025, 10:15:03) [MSC v.1944 64 bit (AMD64)] on win32
Enter "help" below or click "Help" above for more information.

====== RESTART: C:\Users\nasks\OneDrive\문서\컴프2 공부\1114-2023100032-송채언-1.py =====
n?3
6

====== RESTART: C:\Users\nasks\OneDrive\문서\컴프2 공부\1114-2023100032-송채언-1.py =====
정수 n? 5
120

====== RESTART: C:\Users\nasks\OneDrive\문서\컴프2 공부\1114-2023100032-송채언-2.py =====
32
56
64
72
12

====== RESTART: C:\Users\nasks\OneDrive\문서\컴프2 공부\1114-2023100032-송채언-2.py =====
입력(종료 시 엔터)> 사과
입력(종료 시 엔터)> 딸기
입력(종료 시 엔터)> 포토
입력(종료 시 엔터)> 딸기
입력(종료 시 엔터)> 
['사과', '딸기', '포토', '딸기']
사과 딸기 포토 딸기 

====== RESTART: C:\Users\nasks\OneDrive\문서\컴프2 공부\1114-2023100032-송채언-3.py =====
['두부', '양배추', '딸기', '사과']
['두부', '양배추', '딸기', '토마토', '사과']
['두부', '양배추', '딸기', '토마토']
['두부', '딸기', '토마토']
토마토
['두부', '딸기']

====== RESTART: C:\Users\nasks\OneDrive\문서\컴프2 공부\1114-2023100032-송채언-3.py =====
['두부, ', '양배추', '토마토', '사과']
None
['두부, ', '양배추', '토마토']
2
3
['두부, ', '양배추', '딸기', '토마토', '사과', '딸기']
2
2
[]
[10, 20, 30, 40, 50, 60]
Traceback (most recent call last):
  File "C:\Users\nasks\OneDrive\문서\컴프2 공부\1114-2023100032-송채언-3.py", line 47, in <module>
    value.extend(40)
TypeError: 'int' object is not iterable
>>> 
====== RESTART: C:\Users\nasks\OneDrive\문서\컴프2 공부\1114-2023100032-송채언-3.py =====
[1, 3, 5, 2, 4, 6]
[1, 3, 5, 2, 4, 6, [2, 4, 6]]
7
[1, 3, 5, 2, 4, 6, [2, 4, 6], [11, 12, 13]]
8
>>> 
====== RESTART: C:\Users\nasks\OneDrive\문서\컴프2 공부\1114-2023100032-송채언-3.py =====
[1, 78, 89, 57]
[1, 57, 78, 89]
[89, 78, 57, 1]
>>> 
====== RESTART: C:\Users\nasks\OneDrive\문서\컴프2 공부\1114-2023100032-송채언-4.py =====
[8, 4, 12, 9, 10] 

원하는 인덱스 번호는? 3
인덱스 [3] 위치에 추가할 값은? 8
[8, 4, 12, 8, 9, 10] 

원하는 인덱스 번호는? 4
인덱스 [4] 위치에 추가할 값은? 5
[8, 4, 12, 8, 5, 9, 10] 

원하는 인덱스 번호는? 
종료...
