Python 3.14.0 (tags/v3.14.0:ebf955d, Oct  7 2025, 10:15:03) [MSC v.1944 64 bit (AMD64)] on win32
Enter "help" below or click "Help" above for more information.

===== RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1114-2023100032-송채언-과제.py =====
----------
1. 친구 리스트 출력
2. 친구 추가
3. 친구 삭제
4. 이름 변경
9. 종료
----------
메뉴 선택: 1
[]
----------
1. 친구 리스트 출력
2. 친구 추가
3. 친구 삭제
4. 이름 변경
9. 종료
----------
메뉴 선택: 2
추가할 이름 입력: 강호동
[]
----------
1. 친구 리스트 출력
2. 친구 추가
3. 친구 삭제
4. 이름 변경
9. 종료
----------
메뉴 선택: 4
변경할 이름 입력: 강호동
새로운 이름 입력: 유재석
[]
----------
1. 친구 리스트 출력
2. 친구 추가
3. 친구 삭제
4. 이름 변경
9. 종료
----------
메뉴 선택: 
========================= RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1114-2023100032-송채언-과제.py =========================
----------
1. 친구 리스트 출력
2. 친구 추가
3. 친구 삭제
4. 이름 변경
9. 종료
----------
메뉴 선택: 9
프로그램을 종료합니다.
>>> 
========================= RESTART: C:/Users/nasks/OneDrive/문서/컴프2 공부/1114-2023100032-송채언-과제.py =========================
----------
1. 친구 리스트 출력
2. 친구 추가
3. 친구 삭제
4. 이름 변경
9. 종료
----------
메뉴 선택: 2
추가할 이름 입력: 강호동
[]
----------
1. 친구 리스트 출력
2. 친구 추가
3. 친구 삭제
4. 이름 변경
9. 종료
----------
메뉴 선택: 3
삭제할 이름 입력: 유재석
[]
----------
1. 친구 리스트 출력
2. 친구 추가
3. 친구 삭제
4. 이름 변경
9. 종료
----------
